jbd0101/esp32s3-privilege-separation/components/protected/esp_syscall/src/esp_syscalls.c
// Copyright 2020-2022 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//         http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.

#include <stdio.h>
#include "string.h"
#include "esp_idf_version.h"
#include <syscall_def.h>
#include "freertos/FreeRTOS.h"
#include "freertos/queue.h"
#include "freertos/task.h"
#include "freertos/semphr.h"
#include "freertos/event_groups.h"

#include "hal/gpio_types.h"
#include "driver/gpio.h"
#include "esp_event.h"
#include "esp_wifi.h"
#include "esp_log.h"
#include <nvs_flash.h>
#include <esp_priv_access_ota_utils.h>
#include <esp_user_ota.h>
#include "syscall_structs.h"
#include "esp_map.h"

#include <lwip/sockets.h>
#include <lwip/netdb.h>

#include "soc_defs.h"

#include "esp_rom_md5.h"

#include <esp_spi_flash.h>
#include <esp_partition.h>
#include <esp_rom_uart.h>
#include "driver/temp_sensor.h"

#ifdef CONFIG_IDF_TARGET_ESP32C3
#include "esp32c3/rom/ets_sys.h"
#endif

#if CONFIG_IDF_TARGET_ARCH_RISCV
#include "riscv/interrupt.h"
#include "riscv/rvruntime-frames.h"
#include "riscv/ecall_context.h"
#elif CONFIG_IDF_TARGET_ARCH_XTENSA
#include "xtensa/syscall_context.h"
#endif

#include <driver/uart.h>

#define TAG     __func__

typedef void (*syscall_t)(void);
typedef void* usr_gpio_handle_t;

static const char *USER_TIMER_STRING = "user_timer";

/* These are the indexes in esp_event_map_arr to store the user space EVENT base.
 * This is required because esp_event_base_t is a string pointer and it is different for protected space
 * as well as user space, so if the user wants to register an event handler for an event handled in protected space,
 * we need to create a mapping for these string pointers and translate them
 */
typedef enum {
    WIFI_EVENT_INDEX = 0,
    IP_EVENT_INDEX,
    ESP_EVENT_MAX_INDEX
} esp_event_index_t;

static bool _is_user_app_up;

static esp_event_base_t esp_event_map_arr[ESP_EVENT_MAX_INDEX];

static DRAM_ATTR int usr_dispatcher_queue_index;
static DRAM_ATTR int usr_mem_cleanup_queue_index;
static int uart_driver_queue_index[UART_NUM_MAX];

static DRAM_ATTR QueueHandle_t usr_dispatcher_queue_handle;
static DRAM_ATTR QueueHandle_t usr_mem_cleanup_queue_handle;

void esp_time_impl_set_boot_time(uint64_t time_us);
uint64_t esp_time_impl_get_boot_time(void);
int64_t esp_system_get_time(void);
int *__real___errno(void);

#ifdef __GNUC__
#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wunused-function"
#endif

int sys_ni_syscall(void)
{
    return -1;
}

int sys_putchar(int c)
{
    return putchar(c);
}

int sys_write_log_line(const char *str, size_t len)
{
    if (!is_valid_user_d_addr((void *)str) ||
        !is_valid_user_d_addr((void *)str + len)) {
        return -1;
    }
    return fwrite(str, len, 1, __getreent()->_stdout);
}

int sys_write_log_line_unlocked(const char *str, size_t len)
{
    if (!is_valid_user_d_addr((void *)str) ||
        !is_valid_user_d_addr((void *)str + len)) {
        return -1;
    }
    if (*(str + len) != '\0') {
        return -1;
    }
    return ets_printf("%s", str);
}

uint32_t sys_ets_get_cpu_frequency(void)
{
    return ets_get_cpu_frequency();
}

void sys_esp_rom_md5_init(md5_context_t *context)
{
    if (!is_valid_udram_addr((void *)context)) {
        return;
    }
    esp_rom_md5_init(context);
}

void sys_esp_rom_md5_update(md5_context_t *context, const void *buf, uint32_t len)
{
    if (!is_valid_udram_addr((void *)context) ||
        !is_valid_user_d_addr((void *)buf)) {
        return;
    }
    esp_rom_md5_update(context, buf, len);
}

void sys_esp_rom_md5_final(uint8_t *digest, md5_context_t *context)
{
    if (!is_valid_udram_addr((void *)digest) ||
        !is_valid_udram_addr((void *)context)) {
        return;
    }
    esp_rom_md5_final(digest, context);
}

int sys_esp_rom_uart_tx_one_char(uint8_t c)
{
    return esp_rom_uart_tx_one_char(c);
}

int sys_esp_rom_uart_rx_one_char(uint8_t *c)
{
    if (!is_valid_udram_addr(c)) {
        return -1;
    }
    return esp_rom_uart_rx_one_char(c);
}

IRAM_ATTR void sys__lock_acquire(_lock_t *lock)
{
    if (!is_valid_udram_addr(lock)) {
        return;
    }
    _lock_acquire(lock);
}

IRAM_ATTR void sys__lock_acquire_recursive(_lock_t *lock)
{
    if (!is_valid_udram_addr(lock)) {
        return;
    }
    _lock_acquire_recursive(lock);
}

IRAM_ATTR int sys__lock_try_acquire(_lock_t *lock)
{
    if (!is_valid_udram_addr(lock)) {
        return -1;
    }
    return _lock_try_acquire(lock);
}

IRAM_ATTR int sys__lock_try_acquire_recursive(_lock_t *lock)
{
    if (!is_valid_udram_addr(lock)) {
        return -1;
    }
    return _lock_try_acquire_recursive(lock);
}

IRAM_ATTR void sys__lock_release(_lock_t *lock)
{
    if (!is_valid_udram_addr(lock)) {
        return;
    }
    _lock_release(lock);
}

IRAM_ATTR void sys__lock_release_recursive(_lock_t *lock)
{
    if (!is_valid_udram_addr(lock)) {
        return;
    }
    _lock_release_recursive(lock);
}

IRAM_ATTR void sys___retarget_lock_acquire(_LOCK_T lock)
{
    if (!is_valid_udram_addr(lock)) {
        return;
    }
    __retarget_lock_acquire(lock);
}

IRAM_ATTR void sys___retarget_lock_acquire_recursive(_LOCK_T lock)
{
    if (!is_valid_udram_addr(lock)) {
        return;
    }
    __retarget_lock_acquire_recursive(lock);
}

IRAM_ATTR int sys___retarget_lock_try_acquire(_LOCK_T lock)
{
    if (!is_valid_udram_addr(lock)) {
        return -1;
    }
    return __retarget_lock_try_acquire(lock);
}

IRAM_ATTR int sys___retarget_lock_try_acquire_recursive(_LOCK_T lock)
{
    if (!is_valid_udram_addr(lock)) {
        return -1;
    }
    return __retarget_lock_try_acquire_recursive(lock);
}

IRAM_ATTR void sys___retarget_lock_release_recursive(_LOCK_T lock)
{
    if (!is_valid_udram_addr(lock)) {
        return;
    }
    __retarget_lock_release_recursive(lock);
}

IRAM_ATTR void sys___retarget_lock_release(_LOCK_T lock)
{
    if (!is_valid_udram_addr(lock)) {
        return;
    }
    __retarget_lock_release(lock);
}

void sys_esp_time_impl_set_boot_time(uint64_t time_us)
{
    esp_time_impl_set_boot_time(time_us);
}

uint64_t sys_esp_time_impl_get_boot_time(void)
{
    return esp_time_impl_get_boot_time();
}

int sys_xTaskCreate(TaskFunction_t pvTaskCode,
                                   const char * const pcName,
                                   void * const pvParameters,
                                   UBaseType_t uxPriority,
                                   const BaseType_t xCoreID,
                                   usr_task_ctx_t *task_ctx)
{
    if (!is_valid_user_i_addr(pvTaskCode)) {
        ESP_LOGE(TAG, "Incorrect address of user function");
        return pdFAIL;
    }

    /* The first user task will be spawn from the protected application so
     * the name and the task context will be from protected space
     */
    if (_is_user_app_up) {
        if (!is_valid_udram_addr((void *)task_ctx)) {
            ESP_LOGE(TAG, "Invalid user task context %p", task_ctx);
            return pdFAIL;
        }

