jbd0101/esp32s3-privilege-separation/components/protected/esp_syscall/src/esp_syscalls.c
        if (!is_valid_user_d_addr((void *)pcName) ||
                !is_valid_user_d_addr((void *)((int)pcName + CONFIG_FREERTOS_MAX_TASK_NAME_LEN))) {
            ESP_LOGE(TAG, "Invalid user task name");
            return pdFAIL;
        }
    }

    TaskHandle_t handle;
    StaticTask_t *xtaskTCB = NULL;
    StackType_t *xtaskStack = NULL, *kernel_stack = NULL;
    int *usr_errno = NULL;
    int err = pdPASS;

    xtaskTCB = heap_caps_malloc(sizeof(StaticTask_t), portTcbMemoryCaps);
    if (xtaskTCB == NULL) {
        ESP_LOGE(TAG, "Insufficient memory for TCB");
        return errCOULD_NOT_ALLOCATE_REQUIRED_MEMORY;
    }

    const int stack_size = task_ctx->stack_size;

    xtaskStack = (StackType_t *)task_ctx->stack;
    if (!is_valid_udram_addr((void *)xtaskStack) || !is_valid_udram_addr((void *)((int)xtaskStack + stack_size))) {
        ESP_LOGE(TAG, "Invalid memory for user stack");
        err = pdFAIL;
        goto failure;
    }

    kernel_stack = heap_caps_malloc(KERNEL_STACK_SIZE, portStackMemoryCaps);
    if (kernel_stack == NULL) {
        ESP_LOGE(TAG, "Insufficient memory for kernel stack");
        err = errCOULD_NOT_ALLOCATE_REQUIRED_MEMORY;
        goto failure;
    }
    memset(kernel_stack, tskSTACK_FILL_BYTE, KERNEL_STACK_SIZE * sizeof(StackType_t));

    usr_errno = task_ctx->task_errno;
    if (!is_valid_udram_addr(usr_errno)) {
        ESP_LOGE(TAG, "Invalid memory for user errno");
        err = pdFAIL;
        goto failure;
    }

    *usr_errno = 0;

    int wrapper_index = esp_map_add(NULL, ESP_MAP_TASK_ID);
    if (!wrapper_index) {
        goto failure;
    }
    esp_map_handle_t *wrapper_handle = esp_map_get_handle(wrapper_index);

    /* Suspend the scheduler to ensure that it does not switch to the newly created task.
     * We need to first set the kernel stack as a TLS and only then it should be executed
     */
    vTaskSuspendAll();
    handle = xTaskCreateStaticPinnedToCore(pvTaskCode, pcName, stack_size, pvParameters, uxPriority, xtaskStack, xtaskTCB, xCoreID);

    wrapper_handle->handle = handle;

    // The 1st (0th index) TLS pointer is used by pthread
    // 2nd TLS pointer is used to store the kernel stack, used when servicing system calls
    // 3rd TLS pointer is used to store the WORLD of the task. 0 = WORLD0 and 1 = WORLD1
    // 4th TLS pointer is used to store the errno variable
    // 5th TLS pointer is used to store the wrapper_index for task handle
    vTaskSetThreadLocalStoragePointerAndDelCallback(handle, ESP_PA_TLS_OFFSET_KERN_STACK, kernel_stack, NULL);
    vTaskSetThreadLocalStoragePointerAndDelCallback(handle, ESP_PA_TLS_OFFSET_WORLD, (void *)1, NULL);
    vTaskSetThreadLocalStoragePointerAndDelCallback(handle, ESP_PA_TLS_OFFSET_ERRNO, usr_errno, NULL);
    vTaskSetThreadLocalStoragePointerAndDelCallback(handle, ESP_PA_TLS_OFFSET_SHIM_HANDLE, (void *)wrapper_index, NULL);
    xTaskResumeAll();

    if (is_valid_udram_addr(task_ctx->task_handle)) {
        *(TaskHandle_t *)(task_ctx->task_handle) = (TaskHandle_t)wrapper_index;
    }

    if (!_is_user_app_up) {
        _is_user_app_up = 1;
    };

    return err;
failure:
    if (xtaskTCB) {
        free(xtaskTCB);
    }
    if (kernel_stack) {
        free(kernel_stack);
    }
    return err;
}


void vPortCleanUpTCB (void *pxTCB)
{
    if (pvTaskGetThreadLocalStoragePointer(pxTCB, ESP_PA_TLS_OFFSET_KERN_STACK) == NULL) {
        /* This means this task is a kernel task.
         * User task has a kernel stack at this index
         * Do nothing and return*/
        return;
    }

    void *usr_ptr;
    void *curr_stack = pxTaskGetStackStart(pxTCB);

    int wrapper_index = (int)pvTaskGetThreadLocalStoragePointer(pxTCB, ESP_PA_TLS_OFFSET_SHIM_HANDLE);
    esp_map_remove(wrapper_index);

    if (is_valid_udram_addr(curr_stack)) {
        /* The stack is the user space stack. Free the kernel space stack */
        void *k_stack = pvTaskGetThreadLocalStoragePointer(pxTCB, ESP_PA_TLS_OFFSET_KERN_STACK);
        free(k_stack);
        usr_ptr = curr_stack;
    } else {
        /* The task might be deleted when it is executing system-call, in that case, the stack point will point to kernel stack.
         * Retrieve the user stack from system call stack frame
         */
#if CONFIG_IDF_TARGET_ARCH_XTENSA
        XtSyscallExcFrame *syscall_stack = (XtSyscallExcFrame *)((uint32_t)pxTaskGetStackStart(pxTCB) + KERNEL_STACK_SIZE - XT_ISTK_FRMSZ);
        usr_ptr = (void *)syscall_stack->user_stack;
        free(curr_stack);
#elif CONFIG_IDF_TARGET_ARCH_RISCV
        RvEcallFrame *syscall_stack = (RvEcallFrame *)((uint32_t)pxTaskGetStackStart(pxTCB) + KERNEL_STACK_SIZE - RV_ESTK_FRMSZ);
        usr_ptr = (void *)syscall_stack->stack;
        free(curr_stack);
#endif
    }

    if (usr_mem_cleanup_queue_handle) {
        // Send user space stack
        xQueueSend(usr_mem_cleanup_queue_handle, &usr_ptr, 0);
        // Send user space errno variable
        usr_ptr = pvTaskGetThreadLocalStoragePointer(pxTCB, ESP_PA_TLS_OFFSET_ERRNO);
        xQueueSend(usr_mem_cleanup_queue_handle, &usr_ptr, 0);
    }

    /* prvDeleteTCB accesses TCB members after this function returns so to avoid use-after-free case,
     * change the ucStaticallyAllocated field such that prvDeleteTCB will free the TCB
     */
    ((StaticTask_t *)pxTCB)->uxDummy20 = 1;
}

void sys_vTaskDelete(TaskHandle_t TaskHandle)
{
    if (TaskHandle == NULL) {
        return vTaskDelete(NULL);
    }
    int wrapper_index = (int)TaskHandle;
    esp_map_handle_t *wrapper_handle = esp_map_verify(wrapper_index, ESP_MAP_TASK_ID);
    if (wrapper_handle == NULL) {
        return;
    }
    return vTaskDelete((TaskHandle_t)wrapper_handle->handle);
}

void sys_vTaskDelay(TickType_t TickstoWait)
{
    vTaskDelay(TickstoWait);
}

void sys_vTaskDelayUntil(TickType_t * const pxPreviousWakeTime, const TickType_t xTimeIncrement)
{
    if (!is_valid_udram_addr(pxPreviousWakeTime)) {
        return;
    }
    vTaskDelayUntil(pxPreviousWakeTime, xTimeIncrement);
}

UBaseType_t sys_uxTaskPriorityGet(const TaskHandle_t xTask)
{
    if (xTask == NULL) {
        return uxTaskPriorityGet(NULL);
    }
    int wrapper_index = (int)xTask;
    esp_map_handle_t *wrapper_handle = esp_map_verify(wrapper_index, ESP_MAP_TASK_ID);
    if (wrapper_handle == NULL) {
        return -1;
    }
    return uxTaskPriorityGet((TaskHandle_t)wrapper_handle->handle);
}

void sys_vTaskPrioritySet(TaskHandle_t xTask, UBaseType_t uxNewPriority)
{
    if (xTask == NULL) {
        return vTaskPrioritySet(xTask, uxNewPriority);
    }
    int wrapper_index = (int)xTask;
    esp_map_handle_t *wrapper_handle = esp_map_verify(wrapper_index, ESP_MAP_TASK_ID);
    if (wrapper_handle == NULL) {
        return;
    }
    vTaskPrioritySet((TaskHandle_t)wrapper_handle->handle, uxNewPriority);
}

UBaseType_t sys_uxTaskPriorityGetFromISR(const TaskHandle_t xTask)
{
    int wrapper_index = (int)xTask;
    esp_map_handle_t *wrapper_handle = esp_map_verify(wrapper_index, ESP_MAP_TASK_ID);
    if (wrapper_handle == NULL) {
        return -1;
    }
    return uxTaskPriorityGetFromISR((TaskHandle_t)wrapper_handle->handle);
}

void sys_vTaskSuspend(TaskHandle_t xTaskToSuspend)
{
    if (xTaskToSuspend == NULL) {
        return vTaskSuspend(NULL);
    }
    int wrapper_index = (int)xTaskToSuspend;
    esp_map_handle_t *wrapper_handle = esp_map_verify(wrapper_index, ESP_MAP_TASK_ID);
    if (wrapper_handle == NULL) {
        return;
    }
    vTaskSuspend((TaskHandle_t)wrapper_handle->handle);
}

void sys_vTaskResume(TaskHandle_t xTaskToResume)
{
    int wrapper_index = (int)xTaskToResume;
    esp_map_handle_t *wrapper_handle = esp_map_verify(wrapper_index, ESP_MAP_TASK_ID);
    if (wrapper_handle == NULL) {
        return;
    }
    vTaskResume((TaskHandle_t)wrapper_handle->handle);
}

BaseType_t sys_xTaskResumeFromISR(TaskHandle_t xTaskToResume)
{
    int wrapper_index = (int)xTaskToResume;
    esp_map_handle_t *wrapper_handle = esp_map_verify(wrapper_index, ESP_MAP_TASK_ID);
    if (wrapper_handle == NULL) {
        return -1;
    }
    return xTaskResumeFromISR((TaskHandle_t)wrapper_handle->handle);
}

