jbd0101/esp32s3-privilege-separation/components/protected/esp_syscall/src/esp_syscalls.c
BaseType_t sys_xTaskAbortDelay(TaskHandle_t xTask)
{
#if INCLUDE_xTaskAbortDelay
    if (xTask == NULL) {
        xTaskAbortDelay(NULL);
    }
    int wrapper_index = (int)xTask;
    esp_map_handle_t *wrapper_handle = esp_map_verify(wrapper_index, ESP_MAP_TASK_ID);
    if (wrapper_handle == NULL) {
        return -1;
    }
    return xTaskAbortDelay((TaskHandle_t)wrapper_handle->handle);
#endif
    return 0;
}

void sys_vPortYield(void)
{
    vPortYield();
}

#if CONFIG_IDF_TARGET_ARCH_RISCV
void sys_vPortEnterCritical(void)
{
    vPortEnterCritical();
}

void sys_vPortExitCritical(void)
{
    vPortExitCritical();
}
#elif CONFIG_IDF_TARGET_ARCH_XTENSA
void sys_vPortEnterCritical(portMUX_TYPE *mux)
{
    vPortEnterCritical(mux);
}

void sys_vPortExitCritical(portMUX_TYPE *mux)
{
    vPortExitCritical(mux);
}
#endif

int sys_xPortEnterCriticalTimeout(spinlock_t *mux, int timeout)
{
#if CONFIG_IDF_TARGET_ESP32S3
    return xPortEnterCriticalTimeout(mux, timeout);
#else
    return -1;
#endif
}

int sys_xPortInterruptedFromISRContext(void)
{
#if CONFIG_IDF_TARGET_ESP32S3
    return xPortInterruptedFromISRContext();
#else
    return -1;
#endif
}

int sys_vPortSetInterruptMask(void)
{
#if CONFIG_IDF_TARGET_ARCH_RISCV
    return vPortSetInterruptMask();
#else
    return 0;
#endif
}

void sys_vPortClearInterruptMask(int mask)
{
#if CONFIG_IDF_TARGET_ARCH_RISCV
    vPortClearInterruptMask(mask);
#endif
}

void sys_vTaskSuspendAll(void)
{
    vTaskSuspendAll();
}

BaseType_t sys_xTaskResumeAll(void)
{
    return xTaskResumeAll();
}

void sys_vTaskStepTick(const TickType_t xTicksToJump)
{
#if CONFIG_FREERTOS_USE_TICKLESS_IDLE
    vTaskStepTick(xTicksToJump);
#endif
}

#if defined(IDF_VERSION_V4_3)
BaseType_t sys_xTaskGenericNotify(TaskHandle_t xTaskToNotify, uint32_t ulValue, eNotifyAction eAction, uint32_t *pulPreviousNotificationValue)
#elif defined(IDF_VERSION_V4_4)
BaseType_t sys_xTaskGenericNotify(TaskHandle_t xTaskToNotify, UBaseType_t uxIndexToNotify, uint32_t ulValue, eNotifyAction eAction, uint32_t *pulPreviousNotificationValue)
#endif
{
    if (!is_valid_udram_addr(pulPreviousNotificationValue)) {
        return pdFAIL;
    }

    int wrapper_index = (int)xTaskToNotify;
    esp_map_handle_t *wrapper_handle = esp_map_verify(wrapper_index, ESP_MAP_TASK_ID);
    if (wrapper_handle == NULL) {
        return 0;
    }
#if defined(IDF_VERSION_V4_3)
    return xTaskGenericNotify((TaskHandle_t)wrapper_handle->handle, ulValue, eAction, pulPreviousNotificationValue);
#elif defined(IDF_VERSION_V4_4)
    return xTaskGenericNotify((TaskHandle_t)wrapper_handle->handle, uxIndexToNotify, ulValue, eAction, pulPreviousNotificationValue);
#endif
}

#if defined(IDF_VERSION_V4_3)
BaseType_t sys_xTaskGenericNotifyFromISR(TaskHandle_t xTaskToNotify, uint32_t ulValue, eNotifyAction eAction, uint32_t *pulPreviousNotificationValue, BaseType_t *pxHigherPriorityTaskWoken)
#elif defined(IDF_VERSION_V4_4)
BaseType_t sys_xTaskGenericNotifyFromISR(TaskHandle_t xTaskToNotify, UBaseType_t uxIndexToNotify, uint32_t ulValue, eNotifyAction eAction, uint32_t *pulPreviousNotificationValue, BaseType_t *pxHigherPriorityTaskWoken)
#endif
{
    if (!is_valid_udram_addr(pulPreviousNotificationValue)) {
        return pdFAIL;
    }

    if (!is_valid_udram_addr(pxHigherPriorityTaskWoken) && pxHigherPriorityTaskWoken != NULL) {
        return pdFAIL;
    }

    int wrapper_index = (int)xTaskToNotify;
    esp_map_handle_t *wrapper_handle = esp_map_verify(wrapper_index, ESP_MAP_TASK_ID);
    if (wrapper_handle == NULL) {
        return -1;
    }
#if defined(IDF_VERSION_V4_3)
    return xTaskGenericNotifyFromISR((TaskHandle_t)wrapper_handle->handle, ulValue, eAction, pulPreviousNotificationValue, pxHigherPriorityTaskWoken);
#elif defined(IDF_VERSION_V4_4)
    return xTaskGenericNotifyFromISR((TaskHandle_t)wrapper_handle->handle, uxIndexToNotify, ulValue, eAction, pulPreviousNotificationValue, pxHigherPriorityTaskWoken);
#endif
}

void sys_vTaskNotifyGiveFromISR(TaskHandle_t xTaskToNotify, BaseType_t *pxHigherPriorityTaskWoken)
{
    if (!is_valid_udram_addr(pxHigherPriorityTaskWoken) && pxHigherPriorityTaskWoken != NULL) {
        return;
    }

    int wrapper_index = (int)xTaskToNotify;
    esp_map_handle_t *wrapper_handle = esp_map_verify(wrapper_index, ESP_MAP_TASK_ID);
    if (wrapper_handle == NULL) {
        return;
    }

    vTaskNotifyGiveFromISR((TaskHandle_t)wrapper_handle->handle, pxHigherPriorityTaskWoken);
}

uint32_t sys_ulTaskNotifyTake(BaseType_t xClearCountOnExit, TickType_t xTicksToWait)
{
    return ulTaskNotifyTake(xClearCountOnExit, xTicksToWait);
}

BaseType_t sys_xTaskNotifyWait(uint32_t ulBitsToClearOnEntry, uint32_t ulBitsToClearOnExit, uint32_t *pulNotificationValue, TickType_t xTicksToWait)
{
    if (!is_valid_udram_addr(pulNotificationValue)) {
        ESP_LOGE(TAG, "Invalid pulNotificationValue pointer");
        return pdFAIL;
    }
    return xTaskNotifyWait(ulBitsToClearOnEntry, ulBitsToClearOnExit, pulNotificationValue, xTicksToWait);
}

BaseType_t sys_xTaskNotifyStateClear(TaskHandle_t xTask)
{
    if (xTask == NULL) {
        return xTaskNotifyStateClear(NULL);
    }
    int wrapper_index = (int)xTask;
    esp_map_handle_t *wrapper_handle = esp_map_verify(wrapper_index, ESP_MAP_TASK_ID);
    if (wrapper_handle == NULL) {
        return -1;
    }
    return xTaskNotifyStateClear((TaskHandle_t)wrapper_handle->handle);
}

TaskHandle_t sys_xTaskGetCurrentTaskHandle(void)
{
    TaskHandle_t handle = xTaskGetCurrentTaskHandle();
    return (TaskHandle_t)pvTaskGetThreadLocalStoragePointer(handle, ESP_PA_TLS_OFFSET_SHIM_HANDLE);
}

TaskHandle_t sys_xTaskGetIdleTaskHandle(void)
{
    return xTaskGetIdleTaskHandle();
}

UBaseType_t sys_uxTaskGetStackHighWaterMark(TaskHandle_t xTask)
{
#if (INCLUDE_uxTaskGetStackHighWaterMark == 1)
    /* uxTaskGetStackHighWaterMark is a system call in user space and we switch the stack to kernel stack
     * when servicing a system call. If we call `uxTaskGetStackHighWaterMark` here, it will give us the high watermark for
     * kernel space stack which is incorrect as the user expects the high watermark for the user space stack. So we
     * manually calculate the high watermark here
     */
    TaskHandle_t handle;
    if (xTask == NULL) {
        handle = xTaskGetCurrentTaskHandle();
    } else {
        int wrapper_index = (int)xTask;
        esp_map_handle_t *wrapper_handle = esp_map_verify(wrapper_index, ESP_MAP_TASK_ID);
        if (wrapper_handle == NULL) {
            return -1;
        }
        handle = (TaskHandle_t)wrapper_handle->handle;
    }

    uint32_t high_watermark = 0U;

    const uint8_t *stackstart = pxTaskGetStackStart(handle);

    if (is_valid_kdram_addr((void *)stackstart)) {
        /* High watermark can be queried for a task executing system-call, in that case, the stack will point to kernel stack.
         * Retrieve the user stack from system call stack frame
         */
#if CONFIG_IDF_TARGET_ARCH_XTENSA
        XtSyscallExcFrame *syscall_stack = (XtSyscallExcFrame *)((uint32_t)stackstart + KERNEL_STACK_SIZE - XT_ISTK_FRMSZ);
        stackstart = (const uint8_t *)syscall_stack->user_stack;
#elif CONFIG_IDF_TARGET_ARCH_RISCV
        RvEcallFrame *syscall_stack = (RvEcallFrame *)((uint32_t)stackstart + KERNEL_STACK_SIZE - RV_ESTK_FRMSZ);
        stackstart = (const uint8_t *)syscall_stack->stack;
#endif
    }

    while (*stackstart == (uint8_t)tskSTACK_FILL_BYTE) {
        stackstart -= portSTACK_GROWTH;
        high_watermark++;
    }

    high_watermark /= (uint32_t)sizeof(StackType_t);

