jbd0101/esp32s3-privilege-separation/components/protected/esp_syscall/src/esp_syscalls.c
    return (configSTACK_DEPTH_TYPE)high_watermark;
#else
    return -1;
#endif
}

eTaskState sys_eTaskGetState(TaskHandle_t xTask)
{
    if (xTask == NULL) {
        return -1;
    }
    int wrapper_index = (int)xTask;
    esp_map_handle_t *wrapper_handle = esp_map_verify(wrapper_index, ESP_MAP_TASK_ID);
    if (wrapper_handle == NULL) {
        return -1;
    }
    return eTaskGetState((TaskHandle_t)wrapper_handle->handle);
}

char *sys_pcTaskGetName(TaskHandle_t xTaskToQuery)
{
    if (xTaskToQuery == NULL) {
        return pcTaskGetName(NULL);
    }
    int wrapper_index = (int)xTaskToQuery;
    esp_map_handle_t *wrapper_handle = esp_map_verify(wrapper_index, ESP_MAP_TASK_ID);
    if (wrapper_handle == NULL) {
        return NULL;
    }
    return pcTaskGetName((TaskHandle_t)wrapper_handle->handle);
}

TaskHandle_t sys_xTaskGetHandle(const char *pcNameToQuery)
{
#if INCLUDE_xTaskGetHandle
    if (is_valid_user_d_addr((void *)pcNameToQuery)) {
        TaskHandle_t handle = xTaskGetHandle(pcNameToQuery);
        return (TaskHandle_t)pvTaskGetThreadLocalStoragePointer(handle, ESP_PA_TLS_OFFSET_SHIM_HANDLE);
    } else {
        return NULL;
    }
#endif
    return 0;
}

TickType_t sys_xTaskGetTickCount(void)
{
    return xTaskGetTickCount();
}

TickType_t sys_xTaskGetTickCountFromISR(void)
{
    return xTaskGetTickCountFromISR();
}

BaseType_t sys_xTaskGetSchedulerState(void)
{
    return xTaskGetSchedulerState();
}

UBaseType_t sys_uxTaskGetNumberOfTasks(void)
{
    return uxTaskGetNumberOfTasks();
}

QueueHandle_t sys_xQueueGenericCreate(uint32_t QueueLength, uint32_t ItemSize, uint8_t ucQueueType)
{
    QueueHandle_t q;
    if (ucQueueType == queueQUEUE_TYPE_CLEANUP) {
        if (!usr_mem_cleanup_queue_index) {
            q = xQueueGenericCreate(QueueLength, ItemSize, queueQUEUE_TYPE_BASE);
            if (q == NULL) {
                return NULL;
            }
            usr_mem_cleanup_queue_index = (intptr_t)esp_map_add(q, ESP_MAP_QUEUE_ID);
            if (!usr_mem_cleanup_queue_index) {
                ESP_LOGE(TAG, "Insufficient memory for shim struct");
                vQueueDelete(q);
                return NULL;
            }
            usr_mem_cleanup_queue_handle = q;
        }
        return (QueueHandle_t)usr_mem_cleanup_queue_index;
    }

    if (ucQueueType == queueQUEUE_TYPE_DISPATCH) {
        if (!usr_dispatcher_queue_index) {
            q = xQueueGenericCreate(QueueLength, ItemSize, queueQUEUE_TYPE_BASE);
            if (q == NULL) {
                return NULL;
            }
            usr_dispatcher_queue_index = (intptr_t)esp_map_add(q, ESP_MAP_QUEUE_ID);
            if (!usr_dispatcher_queue_index) {
                ESP_LOGE(TAG, "Insufficient memory for shim struct");
                vQueueDelete(q);
                return NULL;
            }
            usr_dispatcher_queue_handle = q;
        }
        return (QueueHandle_t)usr_dispatcher_queue_index;
    }

    q = xQueueGenericCreate(QueueLength, ItemSize, ucQueueType);
    if (q == NULL) {
        return NULL;
    }

    int wrapper_index = esp_map_add(q, ESP_MAP_QUEUE_ID);
    if (!wrapper_index) {
        ESP_LOGE(TAG, "Insufficient memory for shim struct");
        vQueueDelete(q);
        return NULL;
    }
    return (QueueHandle_t)wrapper_index;
}

void sys_vQueueDelete(QueueHandle_t xQueue)
{
    if (xQueue == (QueueHandle_t)usr_mem_cleanup_queue_index) {
        ESP_LOGE(TAG, "User mem cleanup queue deletion forbidden");
        return;
    }

    if (xQueue == (QueueHandle_t)usr_dispatcher_queue_index) {
        ESP_LOGE(TAG, "User dispatcher queue deletion forbidden");
        return;
    }

    int wrapper_index = (int)xQueue;
    esp_map_handle_t *wrapper_handle = esp_map_verify(wrapper_index, ESP_MAP_QUEUE_ID);
    if (wrapper_handle == NULL) {
        return;
    }
    vQueueDelete((QueueHandle_t)wrapper_handle->handle);
    esp_map_remove(wrapper_index);
}

BaseType_t sys_xQueueGenericSend(QueueHandle_t xQueue, const void * const pvItemToQueue, TickType_t xTicksToWait, const BaseType_t xCopyPosition)
{
    int wrapper_index = (int)xQueue;
    esp_map_handle_t *wrapper_handle = esp_map_verify(wrapper_index, ESP_MAP_QUEUE_ID);
    if (wrapper_handle == NULL) {
        return 0;
    }
    // Incase of Semaphore, pvItemToQueue is NULL. Add an extra check for uxItemSize, which for Semaphore is 0
    // If the uxItemSize if 0, we can allow invalid pvItemToQueue pointer
    if ((is_valid_user_d_addr((void *)pvItemToQueue) || ((StaticQueue_t *)wrapper_handle->handle)->uxDummy4[2] == 0)) {
        return xQueueGenericSend((QueueHandle_t)wrapper_handle->handle, pvItemToQueue, xTicksToWait, xCopyPosition);
    } else {
        return 0;
    }
}

BaseType_t sys_xQueueGenericSendFromISR(QueueHandle_t xQueue, const void * const pvItemToQueue, BaseType_t * const pxHigherPriorityTaskWoken, const BaseType_t xCopyPosition)
{
    if (!is_valid_udram_addr((void *)pxHigherPriorityTaskWoken) && pxHigherPriorityTaskWoken != NULL) {
        return 0;
    }

    if (is_valid_user_d_addr((void *)pvItemToQueue)) {
        int wrapper_index = (int)xQueue;
        esp_map_handle_t *wrapper_handle = esp_map_verify(wrapper_index, ESP_MAP_QUEUE_ID);
        if (wrapper_handle == NULL) {
            return 0;
        }
        return xQueueGenericSendFromISR((QueueHandle_t)wrapper_handle->handle, pvItemToQueue, pxHigherPriorityTaskWoken, xCopyPosition);
    } else {
        return 0;
    }
}

int sys_xQueueReceive(QueueHandle_t xQueue, void * const buffer, TickType_t TickstoWait)
{
    if (is_valid_udram_addr(buffer)) {
        int wrapper_index = (int)xQueue;
        esp_map_handle_t *wrapper_handle = esp_map_verify(wrapper_index, ESP_MAP_QUEUE_ID);
        if (wrapper_handle == NULL) {
            return 0;
        }
        return xQueueReceive((QueueHandle_t)wrapper_handle->handle, buffer, TickstoWait);
    }
    return -1;
}

BaseType_t sys_xQueueReceiveFromISR(QueueHandle_t xQueue, void * const pvBuffer, BaseType_t * const pxHigherPriorityTaskWoken)
{
    if (!is_valid_udram_addr((void *)pxHigherPriorityTaskWoken) && pxHigherPriorityTaskWoken != NULL) {
        return 0;
    }

    if (is_valid_udram_addr((void *)pvBuffer)) {
        int wrapper_index = (int)xQueue;
        esp_map_handle_t *wrapper_handle = esp_map_verify(wrapper_index, ESP_MAP_QUEUE_ID);
        if (wrapper_handle == NULL) {
            return 0;
        }
        return xQueueReceiveFromISR((QueueHandle_t)wrapper_handle->handle, pvBuffer, pxHigherPriorityTaskWoken);
    } else {
        return 0;
    }
}

UBaseType_t sys_uxQueueMessagesWaiting(const QueueHandle_t xQueue)
{
    int wrapper_index = (int)xQueue;
    esp_map_handle_t *wrapper_handle = esp_map_verify(wrapper_index, ESP_MAP_QUEUE_ID);
    if (wrapper_handle == NULL) {
        return 0;
    }
    return uxQueueMessagesWaiting((QueueHandle_t)wrapper_handle->handle);
}

UBaseType_t sys_uxQueueMessagesWaitingFromISR(const QueueHandle_t xQueue)
{
    int wrapper_index = (int)xQueue;
    esp_map_handle_t *wrapper_handle = esp_map_verify(wrapper_index, ESP_MAP_QUEUE_ID);
    if (wrapper_handle == NULL) {
        return 0;
    }
    return uxQueueMessagesWaitingFromISR((QueueHandle_t)wrapper_handle->handle);
}

