jbd0101/esp32s3-privilege-separation/components/protected/esp_syscall/src/esp_syscalls.c
UBaseType_t sys_uxQueueSpacesAvailable(const QueueHandle_t xQueue)
{
    int wrapper_index = (int)xQueue;
    esp_map_handle_t *wrapper_handle = esp_map_verify(wrapper_index, ESP_MAP_QUEUE_ID);
    if (wrapper_handle == NULL) {
        return 0;
    }
    return uxQueueSpacesAvailable((QueueHandle_t)wrapper_handle->handle);
}

BaseType_t sys_xQueueGenericReset(QueueHandle_t xQueue, BaseType_t xNewQueue)
{
    int wrapper_index = (int)xQueue;
    esp_map_handle_t *wrapper_handle = esp_map_verify(wrapper_index, ESP_MAP_QUEUE_ID);
    if (wrapper_handle == NULL) {
        return 0;
    }
    return xQueueGenericReset((QueueHandle_t)wrapper_handle->handle, xNewQueue);
}

BaseType_t sys_xQueuePeek(QueueHandle_t xQueue, void * const pvBuffer, TickType_t xTicksToWait)
{
    if (is_valid_udram_addr((void *)pvBuffer)) {
        int wrapper_index = (int)xQueue;
        esp_map_handle_t *wrapper_handle = esp_map_verify(wrapper_index, ESP_MAP_QUEUE_ID);
        if (wrapper_handle == NULL) {
            return 0;
        }
        return xQueuePeek((QueueHandle_t)wrapper_handle->handle, pvBuffer, xTicksToWait);
    } else {
        return 0;
    }
}

BaseType_t sys_xQueuePeekFromISR(QueueHandle_t xQueue,  void * const pvBuffer)
{
    if (is_valid_udram_addr((void *)pvBuffer)) {
        int wrapper_index = (int)xQueue;
        esp_map_handle_t *wrapper_handle = esp_map_verify(wrapper_index, ESP_MAP_QUEUE_ID);
        if (wrapper_handle == NULL) {
            return 0;
        }
        return xQueuePeekFromISR((QueueHandle_t)wrapper_handle->handle, pvBuffer);
    } else {
        return 0;
    }
}

BaseType_t sys_xQueueIsQueueEmptyFromISR(const QueueHandle_t xQueue)
{
    int wrapper_index = (int)xQueue;
    esp_map_handle_t *wrapper_handle = esp_map_verify(wrapper_index, ESP_MAP_QUEUE_ID);
    if (wrapper_handle == NULL) {
        return 0;
    }
    return xQueueIsQueueEmptyFromISR((QueueHandle_t)wrapper_handle->handle);
}

BaseType_t sys_xQueueIsQueueFullFromISR(const QueueHandle_t xQueue)
{
    int wrapper_index = (int)xQueue;
    esp_map_handle_t *wrapper_handle = esp_map_verify(wrapper_index, ESP_MAP_QUEUE_ID);
    if (wrapper_handle == NULL) {
        return 0;
    }
    return xQueueIsQueueFullFromISR((QueueHandle_t)wrapper_handle->handle);
}

QueueSetHandle_t sys_xQueueCreateSet(const UBaseType_t uxEventQueueLength)
{
    QueueSetHandle_t pxQueue;

    pxQueue = sys_xQueueGenericCreate(uxEventQueueLength, sizeof(QueueHandle_t *), queueQUEUE_TYPE_SET);

    int wrapper_index = esp_map_add(pxQueue, ESP_MAP_QUEUE_ID);
    if (!wrapper_index) {
        vQueueDelete(pxQueue);
        return NULL;
    }

    return (QueueSetHandle_t)wrapper_index;
}

BaseType_t sys_xQueueAddToSet(QueueSetMemberHandle_t xQueueOrSemaphore, QueueSetHandle_t xQueueSet)
{
    int wrapper_index = (int)xQueueOrSemaphore;
    esp_map_handle_t *wrapper_handle = esp_map_verify(wrapper_index, ESP_MAP_QUEUE_ID);
    if (wrapper_handle == NULL) {
        return 0;
    }
    return xQueueAddToSet(xQueueOrSemaphore, (QueueHandle_t)wrapper_handle->handle);
}

BaseType_t sys_xQueueRemoveFromSet(QueueSetMemberHandle_t xQueueOrSemaphore, QueueSetHandle_t xQueueSet)
{
    int wrapper_index = (int)xQueueOrSemaphore;
    esp_map_handle_t *wrapper_handle = esp_map_verify(wrapper_index, ESP_MAP_QUEUE_ID);
    if (wrapper_handle == NULL) {
        return 0;
    }
    return xQueueRemoveFromSet(xQueueOrSemaphore, (QueueHandle_t)wrapper_handle->handle);
}

QueueSetMemberHandle_t sys_xQueueSelectFromSet(QueueSetHandle_t xQueueSet, TickType_t const xTicksToWait)
{
    int wrapper_index = (int)xQueueSet;
    esp_map_handle_t *wrapper_handle = esp_map_verify(wrapper_index, ESP_MAP_QUEUE_ID);
    if (wrapper_handle == NULL) {
        return NULL;
    }
    return xQueueSelectFromSet((QueueHandle_t)wrapper_handle->handle, xTicksToWait);
}

QueueSetMemberHandle_t sys_xQueueSelectFromSetFromISR(QueueSetHandle_t xQueueSet)
{
    int wrapper_index = (int)xQueueSet;
    esp_map_handle_t *wrapper_handle = esp_map_verify(wrapper_index, ESP_MAP_QUEUE_ID);
    if (wrapper_handle == NULL) {
        return NULL;
    }
    return xQueueSelectFromSetFromISR((QueueHandle_t)wrapper_handle->handle);
}

QueueHandle_t sys_xQueueCreateCountingSemaphore(const UBaseType_t uxMaxCount, const UBaseType_t uxInitialCount)
{
    QueueHandle_t q = xQueueCreateCountingSemaphore(uxMaxCount, uxInitialCount);
    if (q == NULL) {
        return NULL;
    }
    int wrapper_index = esp_map_add(q, ESP_MAP_QUEUE_ID);
    if (!wrapper_index) {
        vQueueDelete(q);
        return NULL;
    }
    return (QueueHandle_t)wrapper_index;
}

QueueHandle_t sys_xQueueCreateMutex(const uint8_t ucQueueType)
{
    QueueHandle_t q = xQueueCreateMutex(ucQueueType);
    if (q == NULL) {
        return NULL;
    }
    int wrapper_index = esp_map_add(q, ESP_MAP_QUEUE_ID);
    if (!wrapper_index) {
        vQueueDelete(q);
        return NULL;
    }
    return (QueueHandle_t)wrapper_index;
}

TaskHandle_t sys_xQueueGetMutexHolder(QueueHandle_t xSemaphore)
{
    int wrapper_index = (int)xSemaphore;
    esp_map_handle_t *wrapper_handle = esp_map_verify(wrapper_index, ESP_MAP_QUEUE_ID);
    if (wrapper_handle == NULL) {
        return NULL;
    }
    TaskHandle_t xTask = xQueueGetMutexHolder((QueueHandle_t)wrapper_handle->handle);
    return (TaskHandle_t)pvTaskGetThreadLocalStoragePointer(xTask, ESP_PA_TLS_OFFSET_SHIM_HANDLE);
}

BaseType_t sys_xQueueSemaphoreTake(QueueHandle_t xQueue, TickType_t xTicksToWait)
{
    int wrapper_index = (int)xQueue;
    esp_map_handle_t *wrapper_handle = esp_map_verify(wrapper_index, ESP_MAP_QUEUE_ID);
    if (wrapper_handle == NULL) {
        return 0;
    }
    // Incase of Semaphore, pvItemToQueue is NULL. Add an extra check for uxItemSize, which for Semaphore is 0.
    if (((StaticQueue_t *)wrapper_handle->handle)->uxDummy4[2] != 0) {
        return 0;
    }
    return xQueueSemaphoreTake((QueueHandle_t)wrapper_handle->handle, xTicksToWait);
}

BaseType_t sys_xQueueTakeMutexRecursive(QueueHandle_t xMutex, TickType_t xTicksToWait)
{
    int wrapper_index = (int)xMutex;
    esp_map_handle_t *wrapper_handle = esp_map_verify(wrapper_index, ESP_MAP_QUEUE_ID);
    if (wrapper_handle == NULL) {
        return 0;
    }
    return xQueueTakeMutexRecursive((QueueHandle_t)wrapper_handle->handle, xTicksToWait);
}

BaseType_t sys_xQueueGiveMutexRecursive(QueueHandle_t xMutex)
{
    int wrapper_index = (int)xMutex;
    esp_map_handle_t *wrapper_handle = esp_map_verify(wrapper_index, ESP_MAP_QUEUE_ID);
    if (wrapper_handle == NULL) {
        return 0;
    }
    return xQueueGiveMutexRecursive((QueueHandle_t)wrapper_handle->handle);
}

BaseType_t sys_xQueueGiveFromISR(QueueHandle_t xQueue, BaseType_t * const pxHigherPriorityTaskWoken)
{
    if (!is_valid_udram_addr((void *)pxHigherPriorityTaskWoken) && pxHigherPriorityTaskWoken != NULL) {
        return pdFAIL;
    }

    int wrapper_index = (int)xQueue;
    esp_map_handle_t *wrapper_handle = esp_map_verify(wrapper_index, ESP_MAP_QUEUE_ID);
    if (wrapper_handle == NULL) {
        return 0;
    }
    return xQueueGiveFromISR((QueueHandle_t)wrapper_handle->handle, pxHigherPriorityTaskWoken);
}

void sys_xtimer_cb(void *timer)
{
    if (!usr_dispatcher_queue_handle) {
        return;
    }

    usr_xtimer_context_t* usr_context = (usr_xtimer_context_t*)pvTimerGetTimerID(timer);
    usr_dispatch_ctx_t dispatch_ctx = {
        .event = ESP_SYSCALL_EVENT_XTIMER,
    };
    memcpy(&dispatch_ctx.dispatch_data.xtimer_args, usr_context, sizeof(usr_xtimer_context_t));

