jbd0101/esp32s3-privilege-separation/components/protected/esp_syscall/src/esp_syscalls.c
    if (xQueueSend(usr_dispatcher_queue_handle, &dispatch_ctx, portMAX_DELAY) != pdPASS) {
        return;
    }
}

TimerHandle_t sys_xTimerCreate(const char * const pcTimerName,
                                      const TickType_t xTimerPeriodInTicks,
                                      const UBaseType_t uxAutoReload,
                                      void * const pvTimerID,
                                      TimerCallbackFunction_t pxCallbackFunction)
{
    TimerHandle_t handle;
    int wrapper_index = 0;

    /* pcTimerName is never used by FreeRTOS kernel. It is just for debugging purpose by the application.
     * We have system call for `pcTimerGetName` so we cannot replace the timer name with our name
     */

    if (!(is_valid_user_i_addr(pxCallbackFunction))) {
        ESP_LOGE(TAG, "Incorrect address space for callback function or user queue");
        return NULL;
    }

    usr_xtimer_context_t *usr_context = heap_caps_malloc(sizeof(usr_xtimer_context_t), MALLOC_CAP_DEFAULT | MALLOC_CAP_INTERNAL);
    if (!usr_context) {
        ESP_LOGE(TAG, "Insufficient memory for user context");
        return NULL;
    }

    handle = xTimerCreate(pcTimerName, xTimerPeriodInTicks, uxAutoReload, usr_context, sys_xtimer_cb);

    if (handle == NULL) {
        free(usr_context);
    } else {
        wrapper_index = esp_map_add(handle, ESP_MAP_XTIMER_ID);
        if (!wrapper_index) {
            xTimerDelete(handle, portMAX_DELAY);
            free(usr_context);
            return NULL;
        }
        usr_context->usr_cb = pxCallbackFunction;
        usr_context->usr_timer_id = pvTimerID;
        usr_context->timerhandle = (void *)wrapper_index;
    }
    return (TimerHandle_t)wrapper_index;
}

BaseType_t sys_xTimerIsTimerActive(TimerHandle_t xTimer)
{
    int wrapper_index = (int)xTimer;
    esp_map_handle_t *wrapper_handle = esp_map_verify(wrapper_index, ESP_MAP_XTIMER_ID);
    if (wrapper_handle == NULL) {
        return pdFALSE;
    }
    return xTimerIsTimerActive((TimerHandle_t)wrapper_handle->handle);
}

void *sys_pvTimerGetTimerID(const TimerHandle_t xTimer)
{
    int wrapper_index = (int)xTimer;
    esp_map_handle_t *wrapper_handle = esp_map_verify(wrapper_index, ESP_MAP_XTIMER_ID);
    if (wrapper_handle == NULL) {
        return NULL;
    }
    usr_xtimer_context_t *usr_context = (usr_xtimer_context_t*)pvTimerGetTimerID((TimerHandle_t)wrapper_handle->handle);

    return usr_context->usr_timer_id;
}

const char *sys_pcTimerGetName(TimerHandle_t xTimer)
{
    int wrapper_index = (int)xTimer;
    esp_map_handle_t *wrapper_handle = esp_map_verify(wrapper_index, ESP_MAP_XTIMER_ID);
    if (wrapper_handle == NULL) {
        return NULL;
    }
    return pcTimerGetName((TimerHandle_t)wrapper_handle->handle);
}

void sys_vTimerSetReloadMode(TimerHandle_t xTimer, const UBaseType_t uxAutoReload)
{
    int wrapper_index = (int)xTimer;
    esp_map_handle_t *wrapper_handle = esp_map_verify(wrapper_index, ESP_MAP_XTIMER_ID);
    if (wrapper_handle == NULL) {
        return;
    }
    vTimerSetReloadMode((TimerHandle_t)wrapper_handle->handle, uxAutoReload);
}

BaseType_t sys_xTimerGenericCommand(TimerHandle_t xTimer, const BaseType_t xCommandID, const TickType_t xOptionalValue, BaseType_t * const pxHigherPriorityTaskWoken, const TickType_t xTicksToWait)
{
    if (!is_valid_udram_addr((void *)pxHigherPriorityTaskWoken) && pxHigherPriorityTaskWoken != NULL) {
        return pdFAIL;
    }

    int wrapper_index = (int)xTimer;
    esp_map_handle_t *wrapper_handle = esp_map_verify(wrapper_index, ESP_MAP_XTIMER_ID);
    if (wrapper_handle == NULL) {
        return pdFAIL;
    }
    int ret = xTimerGenericCommand((TimerHandle_t)wrapper_handle->handle, xCommandID, xOptionalValue, pxHigherPriorityTaskWoken, xTicksToWait);
    if (ret == pdPASS && xCommandID == tmrCOMMAND_DELETE) {
        esp_map_remove(wrapper_index);
    }
    return ret;
}

void sys_vTimerSetTimerID(TimerHandle_t xTimer, void *pvNewID)
{
    int wrapper_index = (int)xTimer;
    esp_map_handle_t *wrapper_handle = esp_map_verify(wrapper_index, ESP_MAP_XTIMER_ID);
    if (wrapper_handle == NULL) {
        return;
    }
    usr_xtimer_context_t *usr_context = (usr_xtimer_context_t*)pvTimerGetTimerID((TimerHandle_t)wrapper_handle->handle);

    usr_context->usr_timer_id = pvNewID;
}

TickType_t sys_xTimerGetPeriod(TimerHandle_t xTimer)
{
    int wrapper_index = (int)xTimer;
    esp_map_handle_t *wrapper_handle = esp_map_verify(wrapper_index, ESP_MAP_XTIMER_ID);
    if (wrapper_handle == NULL) {
        return 0;
    }
    return xTimerGetPeriod((TimerHandle_t)wrapper_handle->handle);
}

TickType_t sys_xTimerGetExpiryTime(TimerHandle_t xTimer)
{
    int wrapper_index = (int)xTimer;
    esp_map_handle_t *wrapper_handle = esp_map_verify(wrapper_index, ESP_MAP_XTIMER_ID);
    if (wrapper_handle == NULL) {
        return 0;
    }
    return xTimerGetExpiryTime((TimerHandle_t)wrapper_handle->handle);
}

EventGroupHandle_t sys_xEventGroupCreate(void)
{
    EventGroupHandle_t handle = xEventGroupCreate();
    if (handle == NULL) {
        return NULL;
    }
    int wrapper_index = esp_map_add(handle, ESP_MAP_EVENT_GROUP_ID);
    if (!wrapper_index) {
        vEventGroupDelete(handle);
        return NULL;
    }
    return (EventGroupHandle_t)wrapper_index;
}

EventBits_t sys_xEventGroupWaitBits(EventGroupHandle_t xEventGroup, const EventBits_t uxBitsToWaitFor, const BaseType_t xClearOnExit, const BaseType_t xWaitForAllBits, TickType_t xTicksToWait)
{
    int wrapper_index = (int)xEventGroup;
    esp_map_handle_t *wrapper_handle = esp_map_verify(wrapper_index, ESP_MAP_EVENT_GROUP_ID);
    if (wrapper_handle == NULL) {
        return 0;
    }
    return xEventGroupWaitBits((EventGroupHandle_t)wrapper_handle->handle, uxBitsToWaitFor, xClearOnExit, xWaitForAllBits, xTicksToWait);
}

EventBits_t sys_xEventGroupSetBits(EventGroupHandle_t xEventGroup, const EventBits_t uxBitsToSet)
{
    int wrapper_index = (int)xEventGroup;
    esp_map_handle_t *wrapper_handle = esp_map_verify(wrapper_index, ESP_MAP_EVENT_GROUP_ID);
    if (wrapper_handle == NULL) {
        return 0;
    }
    return xEventGroupSetBits((EventGroupHandle_t)wrapper_handle->handle, uxBitsToSet);
}

EventBits_t sys_xEventGroupClearBits(EventGroupHandle_t xEventGroup, const EventBits_t uxBitsToClear)
{
    int wrapper_index = (int)xEventGroup;
    esp_map_handle_t *wrapper_handle = esp_map_verify(wrapper_index, ESP_MAP_EVENT_GROUP_ID);
    if (wrapper_handle == NULL) {
        return 0;
    }
    return xEventGroupClearBits((EventGroupHandle_t)wrapper_handle->handle, uxBitsToClear);
}

EventBits_t sys_xEventGroupSync(EventGroupHandle_t xEventGroup, const EventBits_t uxBitsToSet, const EventBits_t uxBitsToWaitFor, TickType_t xTicksToWait)
{
    int wrapper_index = (int)xEventGroup;
    esp_map_handle_t *wrapper_handle = esp_map_verify(wrapper_index, ESP_MAP_EVENT_GROUP_ID);
    if (wrapper_handle == NULL) {
        return 0;
    }
    return xEventGroupSync((EventGroupHandle_t)wrapper_handle->handle, uxBitsToSet, uxBitsToWaitFor, xTicksToWait);
}

void sys_vEventGroupDelete(EventGroupHandle_t xEventGroup)
{
    int wrapper_index = (int)xEventGroup;
    esp_map_handle_t *wrapper_handle = esp_map_verify(wrapper_index, ESP_MAP_EVENT_GROUP_ID);
    if (wrapper_handle == NULL) {
        return;
    }
    vEventGroupDelete((EventGroupHandle_t)wrapper_handle->handle);
    esp_map_remove(wrapper_index);
    return;
}

int sys_lwip_socket(int domain, int type, int protocol)
{
    return lwip_socket(domain, type, protocol);
}

