jbd0101/esp32s3-privilege-separation/components/protected/esp_syscall/src/esp_syscalls.c
int sys_lwip_connect(int s, const struct sockaddr *name, socklen_t namelen)
{
    if (!is_valid_udram_addr((void *)name)) {
        return -1;
    }
    return lwip_connect(s, name, namelen);
}

int sys_lwip_accept(int s, struct sockaddr *addr, socklen_t *addrlen)
{
    if (!is_valid_udram_addr(addr) || !is_valid_udram_addr(addrlen)) {
        return -1;
    }
    return lwip_accept(s, addr, addrlen);
}

int sys_lwip_bind(int s, const struct sockaddr *name, socklen_t namelen)
{
    if (!is_valid_udram_addr((void *)name)) {
        return -1;
    }
    return lwip_bind(s, name, namelen);
}

int sys_lwip_shutdown(int s, int how)
{
    return lwip_shutdown(s, how);
}

int sys_getaddrinfo(const char *nodename, const char *servname,
       const struct addrinfo *hints, struct addrinfo **res)
{
    int ret;
    struct addrinfo *tmp_res;
    ret = getaddrinfo(nodename, servname, hints, &tmp_res);
    if (ret == 0) {
        struct addrinfo *usr_res = *res;
        if (!is_valid_udram_addr(usr_res) || !is_valid_udram_addr(usr_res + NETDB_ELEM_SIZE)) {
            ESP_LOGE(TAG, "Invalid user addrinfo pointer");
            freeaddrinfo(tmp_res);
            return -1;
        }
        memcpy(usr_res, tmp_res, NETDB_ELEM_SIZE);
        if (tmp_res->ai_next) {
            ESP_LOGW(TAG, "More nodes in linked list..skipping");
            usr_res->ai_next = NULL;
        }
        // Correct the location of ai_addr wrt user pointer. Data is already copied above by memcpy
        usr_res->ai_addr = (struct sockaddr *)(void *)((u8_t *)usr_res + sizeof(struct addrinfo));

        // Correct the location of nodename wrt user pointer. Data is already copied above by memcpy
        usr_res->ai_canonname = ((char *)usr_res + sizeof(struct addrinfo) + sizeof(struct sockaddr_storage));

        freeaddrinfo(tmp_res);
    }
    return ret;
}

int sys_lwip_getpeername(int s, struct sockaddr *name, socklen_t *namelen)
{
    if (!is_valid_udram_addr((void *)name) || !is_valid_udram_addr((void *)namelen)) {
        return -1;
    }

    return lwip_getpeername(s, name, namelen);
}

int sys_lwip_getsockname(int s, struct sockaddr *name, socklen_t *namelen)
{
    if (!is_valid_udram_addr((void *)name) || !is_valid_udram_addr((void *)namelen)) {
        return -1;
    }

    return lwip_getsockname(s, name, namelen);
}

int sys_lwip_setsockopt(int s, int level, int optname, const void *optval, socklen_t optlen)
{
    if (!is_valid_udram_addr((void *)optval) || !is_valid_udram_addr((void *)((int)optval + optlen))) {
        return -1;
    }
    return lwip_setsockopt(s, level, optname, optval, optlen);
}

int sys_lwip_getsockopt(int s, int level, int optname, void *optval, socklen_t *optlen)
{
    if (!is_valid_udram_addr((void *)optval) || !is_valid_udram_addr((void *)optlen)) {
        return -1;
    }

    return lwip_getsockopt(s, level, optname, optval, optlen);
}

int sys_lwip_listen(int s, int backlog)
{
    return lwip_listen(s, backlog);
}

size_t sys_lwip_recv(int s, void *mem, size_t len, int flags)
{
    if (!is_valid_udram_addr(mem) || !is_valid_udram_addr((void *)((int)mem + len))) {
        return -1;
    }
    return lwip_recv(s, mem, len, flags);
}

ssize_t sys_lwip_recvmsg(int s, struct msghdr *message, int flags)
{
    if (!is_valid_udram_addr((void *)message) ||
        !is_valid_udram_addr((void *)message->msg_iov) ||
        !is_valid_udram_addr((void *)message->msg_iov->iov_base) ||
        !is_valid_udram_addr((void *)message->msg_control)) {
        return -1;
    }

    return lwip_recvmsg(s, message, flags);
}

ssize_t sys_lwip_recvfrom(int s, void *mem, size_t len, int flags, struct sockaddr *from, socklen_t *fromlen)
{
    if (!is_valid_udram_addr((void *)mem) || !is_valid_udram_addr((void *)((int)mem + len)) ||
        !is_valid_udram_addr((void *)from) ||
        !is_valid_udram_addr((void *)fromlen)) {
        return -1;
    }

    return lwip_recvfrom(s, mem, len, flags, from, fromlen);
}

size_t sys_lwip_send(int s, const void *data, size_t size, int flags)
{
    if (!is_valid_user_d_addr((void *)data) || !is_valid_user_d_addr((void *)((int)data + size))) {
        return -1;
    }
    return lwip_send(s, data, size, flags);
}

ssize_t sys_lwip_sendmsg(int s, const struct msghdr *msg, int flags)
{
    if (!is_valid_udram_addr((void *)msg) ||
        !is_valid_udram_addr((void *)msg->msg_iov) ||
        !is_valid_udram_addr((void *)msg->msg_iov->iov_base) ||
        !is_valid_udram_addr((void *)msg->msg_control)) {
        return -1;
    }

    return lwip_sendmsg(s, msg, flags);
}

ssize_t sys_lwip_sendto(int s, const void *data, size_t size, int flags, const struct sockaddr *to, socklen_t tolen)
{
    if (!is_valid_user_d_addr((void *)data) || !is_valid_user_d_addr((void *)((int)data + size)) ||
        !is_valid_user_d_addr((void *)to)) {
        return -1;
    }

    return lwip_sendto(s, data, size, flags, to, tolen);
}

const char *sys_lwip_inet_ntop(int af, const void *src, char *dst, socklen_t size)
{
    if (!is_valid_user_d_addr((void *)src) ||
        !is_valid_udram_addr((void *)dst)) {
        return NULL;
    }

    return lwip_inet_ntop(af, src, dst, size);
}

int sys_lwip_inet_pton(int af, const char *src, void *dst)
{
    if (!is_valid_user_d_addr((void *)src) ||
        !is_valid_udram_addr((void *)dst)) {
        return -1;
    }

    return lwip_inet_pton(af, src, dst);
}

u32_t sys_lwip_htonl(u32_t n)
{
    return lwip_htonl(n);
}

u16_t sys_lwip_htons(u16_t n)
{
    return lwip_htons(n);
}

int *sys___errno(void)
{
    return pvTaskGetThreadLocalStoragePointer(NULL, ESP_PA_TLS_OFFSET_ERRNO);
}

/* __wrap___errno is called when errno is accessed in protected app */
int *__wrap___errno(void)
{
    void *tls_errno = pvTaskGetThreadLocalStoragePointer(NULL, ESP_PA_TLS_OFFSET_ERRNO);
    // If TLS pointer is set, it indicates a user task.
    if (tls_errno) {
        return tls_errno;
    }
    return __real___errno();
}

int sys_open(const char *path, int flags, int mode)
{
    if (is_valid_user_d_addr((void *)path)) {
        return open(path, flags, mode);
    }
    return -1;
}

int sys_write(int s, const void *data, size_t size)
{
    if (is_valid_user_d_addr((void *)data) && is_valid_user_d_addr((void *)((int)data + size))) {
        return write(s, data, size);
    }
    return -1;
}

int sys_read(int s, void *mem, size_t len)
{
    if (is_valid_udram_addr(mem) && is_valid_udram_addr((void *)((int)mem + len))) {
        return read(s, mem, len);
    }
    return -1;
}

int sys_close(int s)
{
    return close(s);
}

int sys_select(int maxfdp1, fd_set *readset, fd_set *writeset, fd_set *exceptset, struct timeval *timeout)
{
    if (is_valid_kernel_d_addr((void *)readset) ||
        is_valid_kernel_d_addr((void *)writeset) ||
        is_valid_kernel_d_addr((void *)exceptset)) {
        return -1;
    }

    return select(maxfdp1, readset, writeset, exceptset, timeout);
}

int sys_poll(struct pollfd *fds, nfds_t nfds, int timeout)
{
    if (!is_valid_udram_addr((void *)fds)) {
        return -1;
    }

    return poll(fds, nfds, timeout);
}

int sys_ioctl(int s, long cmd, void *argp)
{
    if (!is_valid_user_d_addr((void *)argp)) {
        return -1;
    }

    return ioctl(s, cmd, argp);
}

int sys_fcntl(int s, int cmd, int val)
{
    return fcntl(s, cmd, val);
}

IRAM_ATTR void sys_gpio_isr_handler(void *args)
{
    if (!usr_dispatcher_queue_handle) {
        return;
    }

    int need_yield;
    usr_dispatch_ctx_t dispatch_ctx = {
        .event = ESP_SYSCALL_EVENT_GPIO,
    };
    memcpy(&dispatch_ctx.dispatch_data.gpio_args, args, sizeof(usr_gpio_args_t));
    if (xQueueSendFromISR(usr_dispatcher_queue_handle, &dispatch_ctx, &need_yield) != pdPASS) {
        return;

