jbd0101/esp32s3-privilege-separation/components/protected/esp_syscall/src/esp_syscalls.c
    }
    if (need_yield == pdTRUE) {
        portYIELD_FROM_ISR();
    }
}

esp_err_t sys_gpio_config(const gpio_config_t *conf)
{
    if (is_valid_user_d_addr((void *)conf)) {
        return gpio_config(conf);
    }

    return ESP_ERR_INVALID_ARG;
}

esp_err_t sys_gpio_install_isr_service(int intr_alloc_flags)
{
    return gpio_install_isr_service(intr_alloc_flags);
}

esp_err_t sys_gpio_softisr_handler_add(gpio_num_t gpio_num, gpio_isr_t isr_handler, void *args, usr_gpio_handle_t *gpio_handle)
{
    esp_err_t ret;
    if (!(is_valid_udram_addr(gpio_handle))) {
        ESP_LOGE(TAG, "Incorrect address space for gpio handle or user queue");
        return ESP_ERR_INVALID_ARG;
    }

    usr_gpio_args_t *usr_context = heap_caps_malloc(sizeof(usr_gpio_args_t), MALLOC_CAP_DEFAULT | MALLOC_CAP_INTERNAL);
    if (!usr_context) {
        ESP_LOGE(TAG, "Insufficient memory for user context");
        return ESP_ERR_NO_MEM;
    }
    usr_context->gpio_num = gpio_num;
    usr_context->usr_isr = isr_handler;
    usr_context->usr_args = args;
    ret = gpio_isr_handler_add(gpio_num, sys_gpio_isr_handler, (void *)usr_context);
    if (ret != ESP_OK) {
        free(usr_context);
    } else {
        int wrapper_index = esp_map_add(usr_context, ESP_MAP_GPIO_ID);
        *gpio_handle = (usr_gpio_handle_t)wrapper_index;
    }
    return ret;
}

esp_err_t sys_gpio_softisr_handler_remove(usr_gpio_handle_t gpio_handle)
{
    esp_err_t ret;
    int wrapper_index = (int)gpio_handle;
    esp_map_handle_t *wrapper_handle = (esp_map_handle_t *)esp_map_verify(wrapper_index, ESP_MAP_GPIO_ID);
    if (!wrapper_handle) {
        return ESP_ERR_INVALID_ARG;
    }
    usr_gpio_args_t *usr_context = (usr_gpio_args_t *)wrapper_handle->handle;
    ret = gpio_isr_handler_remove(usr_context->gpio_num);
    if (ret == ESP_OK) {
        gpio_uninstall_isr_service();
        free(usr_context);
        esp_map_remove(wrapper_index);
    }
    return ret;
}

esp_err_t sys_gpio_set_level(gpio_num_t gpio_num, uint32_t level)
{
    return gpio_set_level(gpio_num, level);
}

esp_err_t sys_nvs_flash_init()
{
    return nvs_flash_init();
}

esp_err_t sys_esp_netif_init()
{
    return esp_netif_init();
}

esp_err_t sys_esp_event_loop_create_default()
{
    return esp_event_loop_create_default();
}

esp_netif_t* sys_esp_netif_create_default_wifi_sta()
{
    esp_netif_t *handle = esp_netif_create_default_wifi_sta();
    int wrapper_index = esp_map_add(handle, ESP_MAP_ESP_NETIF_ID);
    if (!wrapper_index) {
        esp_netif_destroy(handle);
        return NULL;
    }
    return (esp_netif_t *)wrapper_index;
}

void sys_event_handler(void* arg, esp_event_base_t event_base,
                                int32_t event_id, void* event_data)
{
    if (!usr_dispatcher_queue_handle) {
        return;
    }

    usr_dispatch_ctx_t dispatch_ctx = {
        .event = ESP_SYSCALL_EVENT_ESP_EVENT,
    };

    if (event_base == WIFI_EVENT) {
        dispatch_ctx.dispatch_data.event_args.event_base = esp_event_map_arr[WIFI_EVENT_INDEX];
    } else if (event_base == IP_EVENT) {
        dispatch_ctx.dispatch_data.event_args.event_base = esp_event_map_arr[IP_EVENT_INDEX];
    } else {
        dispatch_ctx.dispatch_data.event_args.event_base = event_base;
    }

    dispatch_ctx.dispatch_data.event_args.event_id = event_id;
    dispatch_ctx.dispatch_data.event_args.event_data = event_data;
    memcpy(&dispatch_ctx.dispatch_data.event_args.usr_context, arg, sizeof(usr_context_t));

    if (xQueueSend(usr_dispatcher_queue_handle, &dispatch_ctx, portMAX_DELAY) == pdFALSE) {
        printf("Error sending message on queue\n");
    }
    return;
}

esp_err_t sys_esp_event_handler_instance_register(esp_event_base_t event_base,
                                              int32_t event_id,
                                              esp_event_handler_t event_handler,
                                              void *event_handler_arg,
                                              esp_event_handler_instance_t *context)
{
    esp_err_t ret;
    esp_event_base_t sys_event_base;

    /* Check the end of event_base string before actually comparing the string with
     * pre-registered events
     */
    if (!is_valid_user_d_addr((void *)event_base) ||
        !is_valid_user_d_addr((void *)((int)event_base + strlen(WIFI_EVENT))) ||
        !is_valid_user_d_addr((void *)((int)event_base + strlen(IP_EVENT)))) {
        ESP_LOGE(TAG, "Invalid event base");
        return ESP_ERR_INVALID_ARG;
    }

    if (strncmp(WIFI_EVENT, event_base, strlen(WIFI_EVENT)) == 0) {
        sys_event_base = WIFI_EVENT;
        esp_event_map_arr[WIFI_EVENT_INDEX] = event_base;
    } else if (strncmp(IP_EVENT, event_base, strlen(IP_EVENT)) == 0) {
        sys_event_base = IP_EVENT;
        esp_event_map_arr[IP_EVENT_INDEX] = event_base;
    } else {
        sys_event_base = event_base;
    }

    if (!(is_valid_udram_addr(context))) {
        ESP_LOGE(TAG, "Incorrect address space for context or user_queue");
        return ESP_ERR_INVALID_ARG;
    }

    usr_context_t *usr_context = heap_caps_malloc(sizeof(usr_context_t), MALLOC_CAP_DEFAULT | MALLOC_CAP_INTERNAL);
    if (!usr_context) {
        ESP_LOGE(TAG, "Insufficient memory for user context");
        return ESP_ERR_NO_MEM;
    }
    usr_context->usr_event_handler = event_handler;
    usr_context->usr_args = event_handler_arg;
    ret = esp_event_handler_instance_register(sys_event_base, event_id, &sys_event_handler, (void *)usr_context, &(usr_context->event_handler_instance));
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to register event handler");
        free(usr_context);
    } else {
        *context = usr_context;
    }
    return ret;
}

esp_err_t sys_esp_event_handler_instance_unregister(esp_event_base_t event_base,
                                                int32_t event_id,
                                                esp_event_handler_instance_t context)
{
    esp_err_t ret;
    esp_event_base_t sys_event_base;

