jbd0101/esp32s3-privilege-separation/components/protected/esp_syscall/src/esp_syscalls.c
    /* Check the end of event_base string before actually comparing the string with
     * pre-registered events
     */
    if (!is_valid_user_d_addr((void *)event_base) ||
        !is_valid_user_d_addr((void *)((int)event_base + strlen(WIFI_EVENT))) ||
        !is_valid_user_d_addr((void *)((int)event_base + strlen(IP_EVENT)))) {
        ESP_LOGE(TAG, "Invalid event base");
        return ESP_ERR_INVALID_ARG;
    }
    if (strncmp(WIFI_EVENT, event_base, strlen(WIFI_EVENT)) == 0) {
        sys_event_base = WIFI_EVENT;
    } else if (strncmp(IP_EVENT, event_base, strlen(IP_EVENT)) == 0) {
        sys_event_base = IP_EVENT;
    } else {
        sys_event_base = event_base;
    }

    usr_context_t *usr_context = (usr_context_t *)context;
    if (usr_context && is_valid_udram_addr(usr_context)) {
        ret = esp_event_handler_instance_unregister(sys_event_base, event_id, usr_context->event_handler_instance);
        if (ret == ESP_OK) {
            free(usr_context);
        }
        return ret;
    } else {
        return ESP_ERR_INVALID_ARG;
    }
}

esp_err_t sys_esp_wifi_init(const wifi_init_config_t *config)
{
    wifi_init_config_t cfg = WIFI_INIT_CONFIG_DEFAULT();
    return esp_wifi_init(&cfg);
}

esp_err_t sys_esp_wifi_set_mode(wifi_mode_t mode)
{
    return esp_wifi_set_mode(mode);
}

esp_err_t sys_esp_wifi_set_config(wifi_interface_t interface, wifi_config_t *conf)
{
    if (is_valid_udram_addr(conf)) {
        return esp_wifi_set_config(interface, conf);
    }
    return -1;
}

esp_err_t sys_esp_wifi_start()
{
    return esp_wifi_start();
}

esp_err_t sys_esp_wifi_connect()
{
    return esp_wifi_connect();
}

IRAM_ATTR uint32_t sys_esp_random(void)
{
    return esp_random();
}

void sys_esp_fill_random(void *buf, size_t len)
{
    if (!is_valid_udram_addr(buf) || !is_valid_udram_addr((void *)((int)buf + len))) {
        return;
    }
    esp_fill_random(buf, len);
}

void sys_esp_timer_dispatch_cb(void* arg)
{
    if (!usr_dispatcher_queue_handle) {
        return;
    }

    usr_dispatch_ctx_t dispatch_ctx = {
        .event = ESP_SYSCALL_EVENT_ESP_TIMER,
    };
    memcpy(&dispatch_ctx.dispatch_data.esp_timer_args, arg, sizeof(esp_timer_create_args_t));
    if (xQueueSend(usr_dispatcher_queue_handle, &dispatch_ctx, portMAX_DELAY) == pdFALSE) {
        ESP_LOGE(TAG, "Error sending message on queue");
    }
}

esp_err_t sys_esp_timer_create(const esp_timer_create_args_t* create_args,
        esp_timer_handle_t* out_handle)
{
    if (!is_valid_user_d_addr((void *)create_args) ||
            !is_valid_udram_addr(out_handle)) {
        return ESP_ERR_INVALID_ARG;
    }

    esp_timer_create_args_t *usr_args = (esp_timer_create_args_t *)heap_caps_malloc(sizeof(esp_timer_create_args_t), MALLOC_CAP_DEFAULT | MALLOC_CAP_INTERNAL);
    if (!usr_args) {
        return ESP_ERR_NO_MEM;
    }
    memcpy(usr_args, create_args, sizeof(esp_timer_create_args_t));
    const esp_timer_create_args_t sys_create_args = {
        .callback = sys_esp_timer_dispatch_cb,
        .arg = usr_args,
        /* The `name` field is only used in esp_timer_dump and this function can only be called from
         * protected application so we can safely replace the user provide timer name with our own
         * name to ensure that no illegal access happens when accessing this string
         *
         * Revisit this when the strings pointers are correctly handled: US-83
         */
        .name = USER_TIMER_STRING,
        .skip_unhandled_events = create_args->skip_unhandled_events,
    };
    esp_timer_handle_t sys_timer_handle = NULL;
    esp_err_t err = esp_timer_create(&sys_create_args, &sys_timer_handle);
    if (err != ESP_OK) {
        free(usr_args);
    }
    esp_timer_handle_t wrapper_index = (esp_timer_handle_t)esp_map_add(sys_timer_handle, ESP_MAP_ESP_TIMER_ID);
    if (!wrapper_index) {
        esp_timer_delete(sys_timer_handle);
        free(usr_args);
        return ESP_ERR_NO_MEM;
    }
    *out_handle = wrapper_index;
    return err;
}

esp_err_t sys_esp_timer_start_once(esp_timer_handle_t timer, uint64_t timeout_us)
{
    int wrapper_index = (int)timer;
    esp_map_handle_t *wrapper_handle = esp_map_verify(wrapper_index, ESP_MAP_ESP_TIMER_ID);
    if (wrapper_handle == NULL) {
        return ESP_ERR_INVALID_ARG;
    }
    return esp_timer_start_once((esp_timer_handle_t)wrapper_handle->handle, timeout_us);
}

esp_err_t sys_esp_timer_start_periodic(esp_timer_handle_t timer, uint64_t period)
{
    int wrapper_index = (int)timer;
    esp_map_handle_t *wrapper_handle = esp_map_verify(wrapper_index, ESP_MAP_ESP_TIMER_ID);
    if (wrapper_handle == NULL) {
        return ESP_ERR_INVALID_ARG;
    }
    return esp_timer_start_periodic((esp_timer_handle_t)wrapper_handle->handle, period);
}

esp_err_t sys_esp_timer_stop(esp_timer_handle_t timer)
{
    int wrapper_index = (int)timer;
    esp_map_handle_t *wrapper_handle = esp_map_verify(wrapper_index, ESP_MAP_ESP_TIMER_ID);
    if (wrapper_handle == NULL) {
        return ESP_ERR_INVALID_ARG;
    }
    return esp_timer_stop((esp_timer_handle_t)wrapper_handle->handle);
}

esp_err_t sys_esp_timer_delete(esp_timer_handle_t timer)
{
    int wrapper_index = (int)timer;
    esp_map_handle_t *wrapper_handle = esp_map_verify(wrapper_index, ESP_MAP_ESP_TIMER_ID);
    if (wrapper_handle == NULL) {
        return ESP_ERR_INVALID_ARG;
    }
    usr_esp_timer_handle_t *handle = (usr_esp_timer_handle_t *)wrapper_handle->handle;
    void *arg = handle->arg;
    esp_err_t err = esp_timer_delete((esp_timer_handle_t)wrapper_handle->handle);
    if (err == ESP_OK) {
        free(arg);
        esp_map_remove(wrapper_index);
    }
    return err;
}

IRAM_ATTR int64_t sys_esp_timer_get_time(void)
{
    return esp_timer_get_time();
}

IRAM_ATTR int64_t sys_esp_timer_get_next_alarm(void)
{
    return esp_timer_get_next_alarm();
}

bool sys_esp_timer_is_active(esp_timer_handle_t timer)
{
    int wrapper_index = (int)timer;
    esp_map_handle_t *wrapper_handle = esp_map_verify(wrapper_index, ESP_MAP_ESP_TIMER_ID);
    if (wrapper_handle == NULL) {
        return ESP_ERR_INVALID_ARG;
    }
    return esp_timer_is_active((esp_timer_handle_t)wrapper_handle->handle);
}

int64_t IRAM_ATTR sys_esp_system_get_time(void)
{
    return esp_system_get_time();
}

esp_err_t sys_uart_driver_install(uart_port_t uart_num, int rx_buffer_size, int tx_buffer_size, int queue_size, QueueHandle_t* uart_queue, int intr_alloc_flags)
{
    if (!is_valid_udram_addr((void *)uart_queue)) {
        return ESP_ERR_INVALID_ARG;
    }
    QueueHandle_t sys_uart_queue = NULL;
    esp_err_t ret = uart_driver_install(uart_num, rx_buffer_size, tx_buffer_size, queue_size, &sys_uart_queue, intr_alloc_flags);
    if (ret != ESP_OK) {
        return ret;
    }
    uart_driver_queue_index[uart_num] = esp_map_add(sys_uart_queue, ESP_MAP_QUEUE_ID);
    *uart_queue = (QueueHandle_t)uart_driver_queue_index[uart_num];
    return ESP_OK;
}

esp_err_t sys_uart_driver_delete(uart_port_t uart_num)
{
    esp_err_t ret = uart_driver_delete(uart_num);
    if (ret == ESP_OK) {
        esp_map_remove(uart_driver_queue_index[uart_num]);
    }
    return ret;
}

