jbd0101/esp32s3-privilege-separation/components/protected/esp_syscall/src/esp_syscalls.c
int sys_uart_write_bytes(uart_port_t uart_num, const void* src, size_t size)
{
    if (!is_valid_user_d_addr((void *)src) || !is_valid_user_d_addr((void *)((int)src + size))) {
        return -1;
    }
    return uart_write_bytes(uart_num, src, size);
}

int sys_uart_read_bytes(uart_port_t uart_num, void* buf, uint32_t length, TickType_t ticks_to_wait)
{
    if (!is_valid_udram_addr(buf) || !is_valid_udram_addr((void *)((int)buf + length))) {
        return -1;
    }
    return uart_read_bytes(uart_num, buf, length, ticks_to_wait);
}

esp_err_t sys_esp_get_protected_heap_stats(protected_heap_stats_t *stats)
{
    if (!is_valid_udram_addr(stats)) {
        return ESP_ERR_INVALID_ARG;
    }
    stats->free_heap_size = heap_caps_get_free_size(MALLOC_CAP_8BIT | MALLOC_CAP_INTERNAL);
    stats->largest_free_block = heap_caps_get_largest_free_block(MALLOC_CAP_8BIT | MALLOC_CAP_INTERNAL);
    stats->min_free_heap = heap_caps_get_minimum_free_size(MALLOC_CAP_8BIT | MALLOC_CAP_INTERNAL);
    return ESP_OK;
}

IRAM_ATTR esp_err_t esp_syscall_spawn_user_task(void *user_entry, int stack_sz, usr_custom_app_desc_t *app_desc)
{
    usr_task_ctx_t task_ctx = {};
    usr_resources_t *user_resources = app_desc->user_app_resources;

    ESP_LOGI(TAG, "User entry point: %p", user_entry);

    task_ctx.stack = (StackType_t *)&user_resources->startup_stack;
    task_ctx.stack_size = stack_sz;
    task_ctx.task_errno = (int *)&user_resources->startup_errno;
    int ret = sys_xTaskCreate(user_entry, "User main task", NULL, 5, 0, &task_ctx);
    if (ret == pdPASS) {
        return ESP_OK;
    }
    return ESP_FAIL;
}

esp_err_t sys_esp_user_ota_cancel_rollback(void)
{
#ifdef CONFIG_PA_ENABLE_USER_APP_ROLLBACK
    return esp_priv_access_mark_user_app_valid_and_cancel_rollback();
#else
    return ESP_FAIL;
#endif
}

esp_err_t sys_esp_ota_user_app(char *url, int len)
{
    if (!is_valid_user_d_addr(url) || !is_valid_user_d_addr(url + len)) {
        return ESP_ERR_INVALID_ARG;
    }
    esp_user_ota_start(url);
    return ESP_OK;
}

void esp_syscall_clear_user_resourses(void)
{
#ifdef CONFIG_PA_CONSOLE_ENABLE
    // Delete the uart driver used in console
    sys_uart_driver_delete(CONFIG_ESP_CONSOLE_UART_NUM);
#endif
    int user_handles = esp_map_get_allocated_size();
    usr_dispatcher_queue_index = 0;
    usr_dispatcher_queue_handle = NULL;
    usr_mem_cleanup_queue_index = 0;
    usr_mem_cleanup_queue_handle = NULL;
    ESP_LOGI(TAG, "Deleting user_app resources");
    for (int i = ESP_MAP_INDEX_OFFSET; i < (ESP_MAP_INDEX_OFFSET + user_handles); i++) {
        esp_map_handle_t *wrapper_handle = esp_map_get_handle(i);
        if (!wrapper_handle) {
            continue;
        }
        switch (ESP_MAP_GET_ID(wrapper_handle)) {
            case ESP_MAP_QUEUE_ID:
                vQueueDelete((QueueHandle_t)wrapper_handle->handle);
                esp_map_remove(i);
                break;

            case ESP_MAP_TASK_ID:
                vTaskDelete((TaskHandle_t)wrapper_handle->handle);
                break;

            case ESP_MAP_ESP_TIMER_ID:
                esp_timer_stop((esp_timer_handle_t)wrapper_handle->handle);
                esp_timer_delete((esp_timer_handle_t)wrapper_handle->handle);
                esp_map_remove(i);
                break;

            case ESP_MAP_XTIMER_ID:
                xTimerDelete((TimerHandle_t)wrapper_handle->handle, 0);
                esp_map_remove(i);
                break;

            case ESP_MAP_EVENT_GROUP_ID:
                vEventGroupDelete((EventGroupHandle_t)wrapper_handle->handle);
                esp_map_remove(i);
                break;

            case ESP_MAP_GPIO_ID:
                sys_gpio_softisr_handler_remove((usr_gpio_handle_t)i);
                break;

            default:
                ESP_EARLY_LOGW(TAG, "Map ID 0x%x not checked", ESP_MAP_GET_ID(wrapper_handle));
                break;
        }
    }

    // Clear _is_user_app_up flag to enable restarting of user app
    _is_user_app_up = 0;
}

esp_err_t sys_start_internal_temperature(temp_sensor_config_t *config)
{
    if (!is_valid_user_d_addr(config)) {
        printf("Invalid user address\n");
        return ESP_ERR_INVALID_ARG;
    }
    temp_sensor_config_t temp_sensor = {
            .dac_offset = TSENS_DAC_L2,
            .clk_div = 6,
    };
    temp_sensor_set_config(temp_sensor);
    temp_sensor_start();
    return ESP_OK;
}

int sys_get_internal_temperature()
{
    float tempe;
    temp_sensor_read_celsius(&tempe);
    return (int)tempe;
}
int sys_add_a_b(int a, int b){
    return a+b;
}
uint32_t sys_esp_log_early_timestamp(){
    return esp_log_early_timestamp();
}


#ifdef CONFIG_ESP_SYSCALL_VERIFY_RETURNED_POINTERS
IRAM_ATTR void sys_verify_returned_ptr(void *ptr, int syscall_num)
{
    if (is_valid_kdram_addr(ptr)) {
        ESP_EARLY_LOGE(TAG, "Raw kernel pointer returned by syscall %d. Aborting...", syscall_num);
        abort();
    }
}
#endif

#ifdef __GNUC__
#pragma GCC diagnostic pop
#endif
